REG_TEL = r'^\d+[0-9-]+\d+$'
REG_POST_CODE = r"\d{3}[-]?\d{4}"
REG_PHONE = r'\d{3}[-]?\d{4}[-]?\d{4}'

CHOICE_ORG_TYPE = (
    ('01', "事業部"),
    ('02', "部署"),
    ('03', "課"),
)
CHOICE_RESIDENCE_TYPE = (
    ('01', "特定活動"),
    ('02', "企業内転勤"),
    ('03', "技術・人文知識・国際業務"),
    ('04', "高度専門職1号"),
    ('09', "高度専門職2号"),
    ('05', "永住者"),
    ('06', "永住者の配偶者"),
    ('07', "日本人の配偶者"),
    ('08', "日本籍"),
)
CHOICE_SEX = (
    ('1', "男"),
    ('2', "女"),
)
CHOICE_MARRIED = (
    ('0', "未婚"),
    ('1', "既婚"),
)
